still-on-cvs-too-bad/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-06-10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Still on CVS? Too Bad!</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="../pdn.css" type="text/css"/>
<link rel='stylesheet' href='https://use.fontawesome.com/releases/v5.8.2/css/all.css' integrity='sha384-oS3vJWv+0UjzBfQzYUhtDYW+Pj2yciDJxpsK1OYPAYjqT085Qq/1cq5FLXAZQ7Ay' crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">
<div class='cover'>
<div class='cover-card'>
<div class='author-name'>Boško Ivanišević</div>
<div class='author-job'>Developer, Theoretical Physicist</div>
<div class='author-bio mbm'>Ruby, JavaScript, Elixir, C++ and few more</div>
<nav id='sidenav' clas='nav'>
<ul class='nav-list'>
<li class='nav-item'><a href='../index.html'>Home</a1> <span>/</span></li>
<li class='nav-item'><a href='../about.html'>About</a> <span>/</span></li>
</ul>
</nav>
<div class='social-links'>
<ul>
<li><a href='https://twitter.com/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-twitter'></i>
</a></li>
<li><a href='https://linkedin.com/in/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-linkedin'></i>
</a></li>
<li><a href='https://github.com/bosko' class='social-link-item' target='_blank'>
<i class='fab fa-github'></i>
</a></li>
<li><a href='https://stackoverflow.com/users/1665470/boško-ivanišević' class='social-link-item' target='_blank'>
<i class='fab fa-stack-overflow'></i>
</a></li>
<li><a href='https://dev.to/bosko' class='social-link-item' target='_blank'>
  <i class='fab fa-dev' title='bosko's DEV Profile'></i>
</a></li>
</ul>
</div>
</div>
</div>
</div>
<main id="content">
<header>
<h1 class="title">Still on CVS? Too Bad!</h1>
<p class="subtitle">2009-06-05</p>
</header><p>
At the and of May 2009 Savannah disks crashed. You can read more about
it <a href="http://lists.gnu.org/archive/html/savannah-users/2009-05/msg00023.html">here</a>. This is something no one can predict. You never know when
your hardware will let you down, and there is no cure for that. Disks
will be replaced, system reinstalled, backups restored and that’s
it. Or is it?
</p>

<p>
Not completely if you are using CVS or SVN and there were some commits
after the last backup. Emacs developers spent few days in the
<a href="http://lists.gnu.org/archive/html/emacs-devel/2009-06/msg00056.html">discussion</a> to determine what commits they lost.
</p>

<p>
Luckily they had Git mirror of CVS repository but what surprises me is
they didn’t move to Git yet. If they were using Git they would have
been able to restore complete repository in a few minutes (maybe
longer for large repositories). Since they already have Git mirror for
Emacs code I really do not understand why do they not switch to Git
completely. Having full history at each developer’s computer is a huge
benefit. Not to mention that Git gives you possibilities you can only
dream of in CVS and SVN.
</p>
</main>
</body>
</html>
